### Production environment
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.cloudflare_zone.main: Reading...
data.cloudflare_zone.main: Read complete after 0s [id=196a92a2c10bfc2ffd05d0063a5f51b7]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD02MzgwYzc3OC03MDc4LTRjZjktODZiZC01YTYzNzFiMWMyYzk7b2JqZWN0SWQ9NDBhMDg1MTctZmY4MC00YjQwLWI0ZTItN2MxNjdhMTc4MjVkO3N1YnNjcmlwdGlvbklkPTE2ZTAxYTAwLWY4MjUtNGM5Ni04YWUyLWU2OGNiNTJjZjY1Mzt0ZW5hbnRJZD1mZmFiMzhkZi1jZGRmLTQzM2YtODU5YS02Y2ZhMTYxYTVjZWI=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "rg-tshort-prod-westeurope-001"
      + tags     = {
          + "environment" = "Production"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
    }

  # azurerm_static_web_app.main will be created
  + resource "azurerm_static_web_app" "main" {
      + api_key                            = (sensitive value)
      + configuration_file_changes_enabled = true
      + default_host_name                  = (known after apply)
      + id                                 = (known after apply)
      + location                           = "westeurope"
      + name                               = "stapp-tshort-prod-001"
      + preview_environments_enabled       = true
      + public_network_access_enabled      = true
      + resource_group_name                = "rg-tshort-prod-westeurope-001"
      + sku_size                           = "Free"
      + sku_tier                           = "Free"
      + tags                               = {
          + "environment" = "Production"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
    }

  # azurerm_static_web_app_custom_domain.primary will be created
  + resource "azurerm_static_web_app_custom_domain" "primary" {
      + domain_name       = "admin.tshort.me"
      + id                = (known after apply)
      + static_web_app_id = (known after apply)
      + validation_token  = (sensitive value)
      + validation_type   = "cname-delegation"
    }

  # cloudflare_record.primary will be created
  + resource "cloudflare_record" "primary" {
      + allow_overwrite = false
      + comment         = "Primary domain for TShort prod Azure Static Web App"
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "admin"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "196a92a2c10bfc2ffd05d0063a5f51b7"
    }

  # time_sleep.wait_for_dns_record will be created
  + resource "time_sleep" "wait_for_dns_record" {
      + create_duration = "2m"
      + id              = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + deployment_token = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>